; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-82)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b14)
    (on b14 b7)
    (on b7 b3)
    (on-table b3)
    (clear b12)
    (on b12 b6)
    (on b6 b11)
    (on b11 b21)
    (on b21 b13)
    (on b13 b17)
    (on b17 b20)
    (on b20 b19)
    (on b19 b24)
    (on b24 b10)
    (on b10 b5)
    (on b5 b16)
    (on b16 b23)
    (on b23 b4)
    (on-table b4)
    (clear b2)
    (on-table b2)
    (clear b18)
    (on b18 b22)
    (on b22 b15)
    (on b15 b8)
    (on b8 b9)
    (on-table b9))
 (:goal (and 
(on-table b3) (on-table b9)
(on b20 b3)
))
)

; plan
1. (unstack b12 b6)
   deleted: (on b12 b6) (clear b12) (arm-empty)
   added: (holding b12) (clear b6)
   goals met: 2 of 3
2. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 3
3. (unstack b6 b11)
   deleted: (on b6 b11) (clear b6) (arm-empty)
   added: (holding b6) (clear b11)
   goals met: 2 of 3
4. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 3
5. (unstack b11 b21)
   deleted: (on b11 b21) (clear b11) (arm-empty)
   added: (holding b11) (clear b21)
   goals met: 2 of 3
6. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 3
7. (unstack b21 b13)
   deleted: (on b21 b13) (clear b21) (arm-empty)
   added: (holding b21) (clear b13)
   goals met: 2 of 3
8. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 3
9. (unstack b13 b17)
   deleted: (on b13 b17) (clear b13) (arm-empty)
   added: (holding b13) (clear b17)
   goals met: 2 of 3
10. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 3
11. (unstack b17 b20)
   deleted: (on b17 b20) (clear b17) (arm-empty)
   added: (holding b17) (clear b20)
   goals met: 2 of 3
12. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 3
13. (unstack b1 b14)
   deleted: (on b1 b14) (clear b1) (arm-empty)
   added: (holding b1) (clear b14)
   goals met: 2 of 3
14. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 3
15. (unstack b14 b7)
   deleted: (on b14 b7) (clear b14) (arm-empty)
   added: (holding b14) (clear b7)
   goals met: 2 of 3
16. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 3
17. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 2 of 3
18. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 3
19. (unstack b20 b19)
   deleted: (on b20 b19) (clear b20) (arm-empty)
   added: (holding b20) (clear b19)
   goals met: 2 of 3
20. (stack b20 b3)
   deleted: (clear b3) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b3)
   goals met: 3 of 3
